# Systems Analysis Options Workflow File Property

Source: https://www.revitapidocs.com/2026/f4634304-0c9c-421f-fea4-efa6e1d527a3.htm

---

| Systems Analysis Options Workflow File Property |
| --- |

The file name of the EnergyPlus workflow script.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string WorkflowFile { get; set; }
```

```
Public Property WorkflowFile As String
	Get
	Set
```

```
public:
property String^ WorkflowFile {
	String^ get ();
	void set (String^ value);
}
```

```
member WorkflowFile : string with get, set
```

#### Property Value

String Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The analysis requires a valid workflow file path or the empty string. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

Remarks When requesting a new system analysis, it is okay to have an empty workflowFile in the SystemsAnalysisOption. In that case,
 the ViewSystemsAnalysisReport would supply the weather file with the default value "HVAC Systems Loads and Sizing.osw". See Also

#### Reference

SystemsAnalysisOptions Class Autodesk.Revit.DB.Analysis Namespace